# Дыма Владимир. КНИТ16-А
# Вычислите определитель квадратной матрицы (массива)

import numpy as np

m = np.array([[1, 3], [2, 4]])
print(np.linalg.det(m))
