# Дыма Владимир. КНИТ06-А
# Вычислите определитель квадратной матрицы (массива)

import numpy as np

e = np.ones((3, 3))
for i in range(3):
    for j in range(3):
        e[i][j] = float(input('Введите элемент e[{}][{}]: '.format(i+1, j+1)))
det = e[0][0] * e[1][1] * e[2][2] + e[0][1] * e[1][2] * e[2][0] + \
      e[0][2] * e[1][0] * e[2][1] - e[0][2] * e[1][1] * e[2][0] - \
      e[0][0] * e[1][2] * e[2][1] - e[0][1] * e[1][0] * e[2][2]
print(det)
