# Дыма Владимир. КНИТ16-А
# Информация об изделиях на складе содержит данные о количестве в зависимости
# от размера детали и её цвета. Составить программу, которая позволит заносить
# и корректировать данные о наличии деталей на складе при поступлении новой
# партии деталей. При этом должна фиксироваться дата поступления деталей.

import numpy as np

KEK = [['Красный', [1, 0], [2, 0], [3, 0]],
       ['Зелёный', [1, 0], [2, 0], [3, 0]],
       ['Синий'], [1, 0], [2, 0], [3, 0]]
print(KEK)
story = []
while True:
    kek = input('Введите через запятую цвет детали, её размер, колличество и '
                  'дату поступления: ')
    kek = kek.split(', ')
    story.append(kek)
    try:
        kek[2] = int(kek[2])
    except IndexError:
        pass
    if kek[0] == 'Красный':
        if kek[1] == 1:
            KEK[0][1][1] += kek[2]
        elif kek[2] == 2:
            KEK[0][2][1] += kek[2]
        else:
            KEK[0][3][1] += kek[2]
    elif kek[0] == 'Зелёный':
        if kek[1] == 1:
            KEK[1][1][1] += kek[2]
        elif kek[2] == 2:
            KEK[1][2][1] += kek[2]
        else:
            KEK[1][3][1] += kek[2]
    elif kek[0] == 'Синий':
        if kek[1] == 1:
            KEK[2][1][1] += kek[2]
        elif kek[2] == 2:
            KEK[2][2][1] += kek[2]
        else:
            KEK[2][3][1] += kek[2]
    elif kek[0] == 'Выход':
        print(KEK)
        for i in range(len(story)):
            print(story[i])
        exit()
